dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l152x8_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L152x8_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L152x8_PINMUX_H_)
# define _STM32L152x8_PINMUX_H_

#define I2C1_SCL_FUNC            0
#define I2C1_SDA_FUNC            1
#define I2C1_SMBA_FUNC           2
#define I2C2_SCL_FUNC            3
#define I2C2_SDA_FUNC            4
#define I2C2_SMBA_FUNC           5
#define LCD_COM0_FUNC            6
#define LCD_COM1_FUNC            7
#define LCD_COM2_FUNC            8
#define LCD_COM3_FUNC            9
#define LCD_COM4_FUNC            10
#define LCD_COM5_FUNC            11
#define LCD_COM6_FUNC            12
#define LCD_COM7_FUNC            13
#define LCD_SEG0_FUNC            14
#define LCD_SEG1_FUNC            15
#define LCD_SEG10_FUNC           16
#define LCD_SEG11_FUNC           17
#define LCD_SEG12_FUNC           18
#define LCD_SEG13_FUNC           19
#define LCD_SEG14_FUNC           20
#define LCD_SEG15_FUNC           21
#define LCD_SEG16_FUNC           22
#define LCD_SEG17_FUNC           23
#define LCD_SEG18_FUNC           24
#define LCD_SEG19_FUNC           25
#define LCD_SEG2_FUNC            26
#define LCD_SEG20_FUNC           27
#define LCD_SEG21_FUNC           28
#define LCD_SEG22_FUNC           29
#define LCD_SEG23_FUNC           30
#define LCD_SEG24_FUNC           31
#define LCD_SEG25_FUNC           32
#define LCD_SEG26_FUNC           33
#define LCD_SEG27_FUNC           34
#define LCD_SEG28_FUNC           35
#define LCD_SEG29_FUNC           36
#define LCD_SEG3_FUNC            37
#define LCD_SEG30_FUNC           38
#define LCD_SEG31_FUNC           39
#define LCD_SEG32_FUNC           40
#define LCD_SEG33_FUNC           41
#define LCD_SEG34_FUNC           42
#define LCD_SEG35_FUNC           43
#define LCD_SEG36_FUNC           44
#define LCD_SEG37_FUNC           45
#define LCD_SEG38_FUNC           46
#define LCD_SEG39_FUNC           47
#define LCD_SEG4_FUNC            48
#define LCD_SEG40_FUNC           49
#define LCD_SEG41_FUNC           50
#define LCD_SEG42_FUNC           51
#define LCD_SEG43_FUNC           52
#define LCD_SEG5_FUNC            53
#define LCD_SEG6_FUNC            54
#define LCD_SEG7_FUNC            55
#define LCD_SEG8_FUNC            56
#define LCD_SEG9_FUNC            57
#define RCC_MCO_FUNC             58
#define RCC_OSC32_IN_FUNC        59
#define RCC_OSC32_OUT_FUNC       60
#define RCC_OSC_IN_FUNC          61
#define RCC_OSC_OUT_FUNC         62
#define RTC_OUT_ALARM_FUNC       63
#define RTC_OUT_CALIB_FUNC       64
#define RTC_REFIN_FUNC           65
#define RTC_TAMP1_FUNC           66
#define RTC_TS_FUNC              67
#define SPI1_MISO_FUNC           68
#define SPI1_MOSI_FUNC           69
#define SPI1_NSS_FUNC            70
#define SPI1_SCK_FUNC            71
#define SPI2_MISO_FUNC           72
#define SPI2_MOSI_FUNC           73
#define SPI2_NSS_FUNC            74
#define SPI2_SCK_FUNC            75
#define SYS_JTCK_SWCLK_FUNC      76
#define SYS_JTDI_FUNC            77
#define SYS_JTDO_TRACESWO_FUNC   78
#define SYS_JTMS_SWDIO_FUNC      79
#define SYS_JTRST_FUNC           80
#define SYS_TRACECK_FUNC         81
#define SYS_TRACED0_FUNC         82
#define SYS_TRACED1_FUNC         83
#define SYS_TRACED2_FUNC         84
#define SYS_TRACED3_FUNC         85
#define SYS_WKUP1_FUNC           86
#define SYS_WKUP2_FUNC           87
#define SYS_WKUP3_FUNC           88
#define TIM10_CH1_FUNC           89
#define TIM11_CH1_FUNC           90
#define TIM2_CH1_FUNC            91
#define TIM2_CH2_FUNC            92
#define TIM2_CH3_FUNC            93
#define TIM2_CH4_FUNC            94
#define TIM2_ETR_FUNC            95
#define TIM3_CH1_FUNC            96
#define TIM3_CH2_FUNC            97
#define TIM3_CH3_FUNC            98
#define TIM3_CH4_FUNC            99
#define TIM3_ETR_FUNC            100
#define TIM4_CH1_FUNC            101
#define TIM4_CH2_FUNC            102
#define TIM4_CH3_FUNC            103
#define TIM4_CH4_FUNC            104
#define TIM4_ETR_FUNC            105
#define TIM9_CH1_FUNC            106
#define TIM9_CH2_FUNC            107
#define TIMX_IC1_FUNC            108
#define TIMX_IC2_FUNC            109
#define TIMX_IC3_FUNC            110
#define TIMX_IC4_FUNC            111
#define TS_G10_IO1_FUNC          112
#define TS_G10_IO2_FUNC          113
#define TS_G10_IO3_FUNC          114
#define TS_G10_IO4_FUNC          115
#define TS_G1_IO1_FUNC           116
#define TS_G1_IO2_FUNC           117
#define TS_G1_IO3_FUNC           118
#define TS_G1_IO4_FUNC           119
#define TS_G2_IO1_FUNC           120
#define TS_G2_IO2_FUNC           121
#define TS_G3_IO1_FUNC           122
#define TS_G3_IO2_FUNC           123
#define TS_G4_IO1_FUNC           124
#define TS_G4_IO2_FUNC           125
#define TS_G4_IO3_FUNC           126
#define TS_G5_IO1_FUNC           127
#define TS_G5_IO2_FUNC           128
#define TS_G5_IO3_FUNC           129
#define TS_G6_IO1_FUNC           130
#define TS_G6_IO2_FUNC           131
#define TS_G7_IO1_FUNC           132
#define TS_G7_IO2_FUNC           133
#define TS_G7_IO3_FUNC           134
#define TS_G7_IO4_FUNC           135
#define TS_G8_IO1_FUNC           136
#define TS_G8_IO2_FUNC           137
#define TS_G8_IO3_FUNC           138
#define TS_G8_IO4_FUNC           139
#define TS_G9_IO1_FUNC           140
#define TS_G9_IO2_FUNC           141
#define USART1_CK_FUNC           142
#define UART1_CK_FUNC            142
#define USART1_CTS_FUNC          143
#define UART1_CTS_FUNC           143
#define USART1_RTS_FUNC          144
#define UART1_RTS_FUNC           144
#define USART1_RX_FUNC           145
#define UART1_RX_FUNC            145
#define USART1_TX_FUNC           146
#define UART1_TX_FUNC            146
#define USART2_CK_FUNC           147
#define UART2_CK_FUNC            147
#define USART2_CTS_FUNC          148
#define UART2_CTS_FUNC           148
#define USART2_RTS_FUNC          149
#define UART2_RTS_FUNC           149
#define USART2_RX_FUNC           150
#define UART2_RX_FUNC            150
#define USART2_TX_FUNC           151
#define UART2_TX_FUNC            151
#define USART3_CK_FUNC           152
#define UART3_CK_FUNC            152
#define USART3_CTS_FUNC          153
#define UART3_CTS_FUNC           153
#define USART3_RTS_FUNC          154
#define UART3_RTS_FUNC           154
#define USART3_RX_FUNC           155
#define UART3_RX_FUNC            155
#define USART3_TX_FUNC           156
#define UART3_TX_FUNC            156
#define USB_DM_FUNC              157
#define USB_DP_FUNC              158

